Ran Plan for 3 projects:

1. dir: `src/backend` workspace: `default`
1. dir: `src/service_acc` workspace: `default`
1. dir: `src/terraform` workspace: `default`
---

### 1. dir: `src/backend` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # local_file.backend will be created
+ resource "local_file" "backend" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../terraform/secret.backend.tfvars"
      + id                   = (known after apply)
    }

  # yandex_iam_service_account.sa will be created
+ resource "yandex_iam_service_account" "sa" {
      + created_at         = (known after apply)
      + description        = (known after apply)
      + folder_id          = (known after apply)
      + id                 = (known after apply)
      + labels             = (known after apply)
      + name               = "sa-bucket"
      + service_account_id = (known after apply)
    }

  # yandex_iam_service_account_static_access_key.sa-static-key will be created
+ resource "yandex_iam_service_account_static_access_key" "sa-static-key" {
      + access_key                   = (known after apply)
      + created_at                   = (known after apply)
      + encrypted_secret_key         = (known after apply)
      + id                           = (known after apply)
      + key_fingerprint              = (known after apply)
      + output_to_lockbox_version_id = (known after apply)
      + secret_key                   = (sensitive value)
      + service_account_id           = (known after apply)
    }

  # yandex_resourcemanager_folder_iam_member.sa-editor will be created
+ resource "yandex_resourcemanager_folder_iam_member" "sa-editor" {
      + folder_id = "b1gpmvq18drtrb8dtdim"
      + member    = (known after apply)
      + role      = "storage.editor"
    }

  # yandex_storage_bucket.tfstate will be created
+ resource "yandex_storage_bucket" "tfstate" {
      + access_key            = (known after apply)
      + acl                   = (known after apply)
      + bucket                = "diplom-osipenkov"
      + bucket_domain_name    = (known after apply)
      + default_storage_class = (known after apply)
      + folder_id             = (known after apply)
      + force_destroy         = true
      + id                    = (known after apply)
      + policy                = (known after apply)
      + secret_key            = (sensitive value)
      + website_domain        = (known after apply)
      + website_endpoint      = (known after apply)

      + anonymous_access_flags (known after apply)

      + grant (known after apply)

      + versioning (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ access_key           = (sensitive value)
+ bucket_name          = "diplom-osipenkov"
+ secret_key           = (sensitive value)
+ service_account_name = "sa-bucket"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d src/backend
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-86f6d945cb-2b2dz:4141/lock?id=Kovrei%252Fnetology_diplom%252Fsrc%252Fbackend%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d src/backend
  ```
Plan: 5 to add, 0 to change, 0 to destroy.

---
### 2. dir: `src/service_acc` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # yandex_iam_service_account.ig-sa will be created
+ resource "yandex_iam_service_account" "ig-sa" {
      + created_at         = (known after apply)
      + description        = "Сервисный аккаунт для управления группой ВМ."
      + folder_id          = (known after apply)
      + id                 = (known after apply)
      + labels             = (known after apply)
      + name               = "sa-ig"
      + service_account_id = (known after apply)
    }

  # yandex_resourcemanager_folder_iam_member.compute_admin will be created
+ resource "yandex_resourcemanager_folder_iam_member" "compute_admin" {
      + folder_id = (sensitive value)
      + member    = (known after apply)
      + role      = "admin"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ service_account_name_ig = "sa-ig"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d src/service_acc
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-86f6d945cb-2b2dz:4141/lock?id=Kovrei%252Fnetology_diplom%252Fsrc%252Fservice_acc%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d src/service_acc
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 3. dir: `src/terraform` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # local_file.atlantis_dt_rendered will be created
+ resource "local_file" "atlantis_dt_rendered" {
      + content              = <<-EOT
            apiVersion: apps/v1
            kind: Deployment
            metadata:
              name: atlantis
              namespace: atlantis
              labels:
                app: atlantis
            spec:
              replicas: 1
              selector:
                matchLabels:
                  app: atlantis
              template:
                metadata:
                  labels:
                    app: atlantis
                spec:
                  containers:
                  - name: atlantis
                    image: ghcr.io/runatlantis/atlantis:v0.34.0
                    env:
                      - name: ATLANTIS_REPO_ALLOWLIST
                        valueFrom:
                          secretKeyRef:
                            name: atlantis-secrets
                            key: repo-allowlist
                      - name: ATLANTIS_GH_USER
                        valueFrom:
                          secretKeyRef:
                            name: atlantis-secrets
                            key: github-user
                      - name: ATLANTIS_GH_TOKEN
                        valueFrom:
                          secretKeyRef:
                            name: atlantis-secrets
                            key: github-token
                      - name: ATLANTIS_GH_WEBHOOK_SECRET
                        valueFrom:
                          secretKeyRef:
                            name: atlantis-secrets
                            key: webhook-secret
                      - name: YC_TOKEN
                        valueFrom:
                          secretKeyRef:
                            name: atlantis-secrets
                            key: yc-token
                      - name: YC_CLOUD_ID
                        valueFrom:
                          secretKeyRef:
                            name: atlantis-secrets
                            key: yc-cloud-id
                      - name: YC_FOLDER_ID
                        valueFrom:
                          secretKeyRef:
                            name: atlantis-secrets
                            key: yc-folder-id
                      - name: AWS_ACCESS_KEY_ID
                        valueFrom:
                          secretKeyRef:
                            name: atlantis-secrets
                            key: s3-access-key
                      - name: AWS_SECRET_ACCESS_KEY
                        valueFrom:
                          secretKeyRef:
                            name: atlantis-secrets
                            key: s3-secret-key
                      - name: AWS_REGION
                        value: "ru-central1"
                      - name: ATLANTIS_PORT
                        value: "4141"
                      - name: AWS_ENDPOINT
                        value: "storage.yandexcloud.net"
                      - name: AWS_EC2_METADATA_DISABLED
                        value: "true"
                      - name: TF_VAR_yc_token
                        valueFrom:
                          secretKeyRef:
                            name: atlantis-secrets
                            key: yc-token
                      - name: TF_VAR_cloud_id
                        valueFrom:
                          secretKeyRef:
                            name: atlantis-secrets
                            key: yc-cloud-id
                      - name: TF_VAR_folder_id
                        valueFrom:
                          secretKeyRef:
                            name: atlantis-secrets
                            key: yc-folder-id
                      - name: TF_VAR_ssh_username
                        valueFrom:
                          secretKeyRef:
                            name: atlantis-secrets
                            key: ssh_username
                      - name: TF_VAR_ssh_pub_key
                        valueFrom:
                          secretKeyRef:
                            name: atlantis-secrets
                            key: ssh-public-key
            
                    ports:
                    - name: http
                      containerPort: 4141
                    resources:
                      requests:
                        cpu: "100m"
                        memory: "256Mi"
                    volumeMounts:
                    - name: terraformrc
                      mountPath: /home/atlantis/.terraformrc
                      subPath: .terraformrc
                  volumes:
                  - name: terraformrc
                    configMap:
                      name: terraformrc
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./../k8s-configs/atlantis/atlantis_dt.yaml"
      + id                   = (known after apply)
    }

  # local_file.hosts_cfg will be created
+ resource "local_file" "hosts_cfg" {
      + content              = <<-EOT
            all:
              hosts: 
                master-1:
                  ansible_host: 178.154.229.226
                  ip: 192.168.10.34
                  access_ip: 178.154.229.226
                  ansible_user: ubuntu
                  ansible_python_interpreter: /usr/bin/python3
                worker-1:
                  ansible_host: 178.154.203.89
                  ip: 192.168.10.10
                  access_ip: 178.154.203.89
                  ansible_user: ubuntu
                  ansible_python_interpreter: /usr/bin/python3
                worker-2:
                  ansible_host: 158.160.95.186
                  ip: 192.168.20.7
                  access_ip: 158.160.95.186
                  ansible_user: ubuntu
                  ansible_python_interpreter: /usr/bin/python3
                worker-3:
                  ansible_host: 84.252.132.26
                  ip: 192.168.30.13
                  access_ip: 84.252.132.26
                  ansible_user: ubuntu
                  ansible_python_interpreter: /usr/bin/python3
              
              children:
                kube_control_plane:
                  hosts: 
                    master-1:
            
                kube_node:
                  hosts: 
                    worker-1:
                    worker-2:
                    worker-3:
            
                etcd:
                  hosts: 
                    master-1:
            
                k8s_cluster:
                  children:
                    kube_control_plane:
                    kube_node:
                calico_rr:
                  hosts: {}
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./hosts.yaml"
      + id                   = (known after apply)
    }

  # yandex_compute_instance.masters["0"] will be updated in-place
~ resource "yandex_compute_instance" "masters" {
        id                        = "fhmqu8pvqh1ra82136dv"
      ~ metadata                  = {
          - "serial-port-enable" = "1" -> null
          - "ssh-keys"           = <<-EOT
                ubuntu:ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMv79Sc4ciJDzjVuo/DOiNibrUOTXO2tO28k8AHXzk+z aos@vm1
            EOT -> null
          + "user-data"          = <<-EOT
                #cloud-config
                users:
                  - name: aos
                    groups: sudo
                    shell: /bin/bash
                    sudo: 'ALL=(ALL) NOPASSWD:ALL'
                    ssh_authorized_keys:
                      - ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMv79Sc4ciJDzjVuo/DOiNibrUOTXO2tO28k8AHXzk+z aos@vm1
                
                #timezone: Europe/Moscow
                #package_update: true
                #package_upgrade: true
                #apt:
                #  preserve_sources_list: true
                #packages:
                #  - docker.io
                #runcmd:
                #  - [ systemctl, docker-reload ]
                #  - [ systemctl, enable, docker.service ]
            EOT
        }
        name                      = "master-1"
        # (14 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # yandex_compute_instance.workers["0"] will be updated in-place
~ resource "yandex_compute_instance" "workers" {
        id                        = "fhm4464p7sf8uk8portd"
      ~ metadata                  = {
          - "serial-port-enable" = "1" -> null
          - "ssh-keys"           = <<-EOT
                ubuntu:ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMv79Sc4ciJDzjVuo/DOiNibrUOTXO2tO28k8AHXzk+z aos@vm1
            EOT -> null
          + "user-data"          = <<-EOT
                #cloud-config
                users:
                  - name: aos
                    groups: sudo
                    shell: /bin/bash
                    sudo: 'ALL=(ALL) NOPASSWD:ALL'
                    ssh_authorized_keys:
                      - ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMv79Sc4ciJDzjVuo/DOiNibrUOTXO2tO28k8AHXzk+z aos@vm1
                
                #timezone: Europe/Moscow
                #package_update: true
                #package_upgrade: true
                #apt:
                #  preserve_sources_list: true
                #packages:
                #  - docker.io
                #runcmd:
                #  - [ systemctl, docker-reload ]
                #  - [ systemctl, enable, docker.service ]
            EOT
        }
        name                      = "worker-1"
        # (14 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # yandex_compute_instance.workers["1"] will be updated in-place
~ resource "yandex_compute_instance" "workers" {
        id                        = "epd76niua0bra2j3p3om"
      ~ metadata                  = {
          - "serial-port-enable" = "1" -> null
          - "ssh-keys"           = <<-EOT
                ubuntu:ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMv79Sc4ciJDzjVuo/DOiNibrUOTXO2tO28k8AHXzk+z aos@vm1
            EOT -> null
          + "user-data"          = <<-EOT
                #cloud-config
                users:
                  - name: aos
                    groups: sudo
                    shell: /bin/bash
                    sudo: 'ALL=(ALL) NOPASSWD:ALL'
                    ssh_authorized_keys:
                      - ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMv79Sc4ciJDzjVuo/DOiNibrUOTXO2tO28k8AHXzk+z aos@vm1
                
                #timezone: Europe/Moscow
                #package_update: true
                #package_upgrade: true
                #apt:
                #  preserve_sources_list: true
                #packages:
                #  - docker.io
                #runcmd:
                #  - [ systemctl, docker-reload ]
                #  - [ systemctl, enable, docker.service ]
            EOT
        }
        name                      = "worker-2"
        # (14 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # yandex_compute_instance.workers["2"] will be updated in-place
~ resource "yandex_compute_instance" "workers" {
        id                        = "fv4u48sqds56t27habtp"
      ~ metadata                  = {
          - "serial-port-enable" = "1" -> null
          - "ssh-keys"           = <<-EOT
                ubuntu:ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMv79Sc4ciJDzjVuo/DOiNibrUOTXO2tO28k8AHXzk+z aos@vm1
            EOT -> null
          + "user-data"          = <<-EOT
                #cloud-config
                users:
                  - name: aos
                    groups: sudo
                    shell: /bin/bash
                    sudo: 'ALL=(ALL) NOPASSWD:ALL'
                    ssh_authorized_keys:
                      - ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMv79Sc4ciJDzjVuo/DOiNibrUOTXO2tO28k8AHXzk+z aos@vm1
                
                #timezone: Europe/Moscow
                #package_update: true
                #package_upgrade: true
                #apt:
                #  preserve_sources_list: true
                #packages:
                #  - docker.io
                #runcmd:
                #  - [ systemctl, docker-reload ]
                #  - [ systemctl, enable, docker.service ]
            EOT
        }
        name                      = "worker-3"
        # (14 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

Plan: 2 to add, 4 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d src/terraform
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis-86f6d945cb-2b2dz:4141/lock?id=Kovrei%252Fnetology_diplom%252Fsrc%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d src/terraform
  ```
Plan: 2 to add, 4 to change, 0 to destroy.

---
### Plan Summary

3 projects, 3 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```